

update inv.mtl_material_transactions
set attribute13 = '2017.07.31 09:00:00'
where 1=1
and transaction_set_id in ('30553423','30555527','30555518','30555509','30555464',
                           '30555442','30555432','30555423','30555405','30555352',
                           '30555257','30555240','30555145','30555070','30555054',
                           '30555025','30555012','30554998','30554905','30554770',
                           '30554744','30554680','30554602','30554556','30554456',
                           '30554441','30554363','30554320','30553276','30553224',
                           '30551917');
						   
select * from wsh.wsh_new_deliveries a
where name in ('ЮК 1954531');

update wsh.wsh_new_deliveries 
set INITIAL_PICKUP_DATE = to_date ('31.07.2017 9:00:00','dd.mm.yyyy hh.mi.ss')
where name in ('ЮК 1954531');